export const keyboards = {
  main: {
    keyboard: [
      [{ text: "🎲 إختيار عشوائي للآية من القرآن الكريم" }],
      [{ text: "📖 تصفح القرآن" }],
      [{ text: "⚙️ الإعدادات" }],
    ],
    resize_keyboard: true,
    one_time_keyboard: false,
  },

  browse: {
    keyboard: [
      [{ text: "📚 السور" }, { text: "🔍 البحث بالرقم" }],
      [{ text: "📑 الفهرس" }, { text: "🔖 العلامات" }],
      [{ text: "⬅️ رجوع للقائمة الرئيسية" }],
    ],
    resize_keyboard: true,
  },

  audio: {
    settings: [
      [{ text: "المصحف المرتل" }, { text: "المصحف المجود" }],
      [{ text: "⬅️ رجوع للقائمة الرئيسية" }],
    ],
    resize_keyboard: true,
  },
  settings: {
    keyboard: [
      [{ text: "🔔 تفعيل الإشعارات" }, { text: "🔕 إيقاف الإشعارات" }],
      [{ text: "📖 تغيير التفسير" }, { text: "🎙 تغيير القارئ" }],
      [{ text: "⬅️ رجوع للقائمة الرئيسية" }],
    ],
    resize_keyboard: true,
  },
  settings_chikh_list: {
    keyboard: [
      [{ text: "عبد الباسط عبد الصمد المرتل" }, { text: "عبد الله بصفر" }],
      [{ text: "عبدالرحمن السديس" }, { text: "عبدالباسط عبدالصمد" }],
      [{ text: "أبو بكر الشاطري" }, { text: "أحمد بن علي العجمي" }],
      [{ text: "مشاري العفاسي" }, { text: "هاني الرفاعي" }],
      [{ text: "محمود خليل الحصري" }, { text: "محمود خليل الحصري (المجود)" }],
      [{ text: "علي بن عبدالرحمن الحذيفي" }, { text: "إبراهيم الأخضر" }],
      [{ text: "ماهر المعيقلي" }, { text: "محمد صديق المنشاوي" }],
      [{ text: "محمد صديق المنشاوي (المجود)" }, { text: "محمد أيوب" }],
      [{ text: "محمد جبريل" }, { text: "سعود الشريم" }],
      [{ text: "أيمن سويد" }],
      [{ text: "⬅️ رجوع للقائمة الرئيسية" }],
    ],
    resize_keyboard: true,
  },
};
